[
    {
        "id": 1,
        "name": "Kyiv",
        "country": "Capital of Ukraine",
        "description": "Kyiv, also spelled Kiev, is the capital and most populous city of Ukraine. It is in north-central Ukraine along the Dnieper River. As of 1 January 2021, its population was 2,962,180, making Kyiv the seventh-most populous city in Europe. Kyiv is an important industrial, scientific, educational, and cultural center in Eastern Europe. It is home to many high-tech industries, higher education institutions, and historical landmarks. The city has an extensive system of public transport and infrastructure, including the Kyiv Metro. The city prospered again during the Russian Empire's Industrial Revolution in the late 19th century. In 1918, when the Ukrainian People's Republic declared independence from Russian Republic, Kyiv became its capital. From the end of the Polish-Soviet War in 1921, Kyiv was a city of Soviet Ukraine, and made its capital in 1934. The city suffered significant destruction during World War II but quickly recovered in the postwar years, remaining the Soviet Union's third-largest city.",
        "more": "Following the collapse of the Soviet Union and Ukrainian independence in 1991, Kyiv remained Ukraine's capital and experienced a steady influx of ethnic Ukrainian migrants from other regions of the country. During the country's transformation to a market economy and electoral democracy, Kyiv has continued to be Ukraine's largest and wealthiest city. Its armament-dependent industrial output fell after the Soviet collapse, adversely affecting science and technology, but new sectors of the economy such as services and finance facilitated Kyiv's growth in salaries and investment, as well as providing continuous funding for the development of housing and urban infrastructure. Kyiv emerged as the most pro-Western region of Ukraine; parties advocating tighter integration with the European Union dominate during elections.",
        "latitude": 50.450001,
        "longitude": 30.523333,
        "heroPicture": "Kyiv",
        "pictures": ["photo2", "photo3", "photo4"],
        "advisory": "We accept no liability for any visitors eaten alive by midges."
    },
    {
        "id": 2,
        "name": "Odessa",
        "country": "SouthWest of Ukraine",
        "description": "Odesa (also spelled Odessa) is the third most populous city and municipality in Ukraine and a major seaport and transport hub located in the south-west of the country, on the northwestern shore of the Black Sea. The city is also the administrative centre of the Odesa Raion and Odesa Oblast, as well as a multiethnic cultural centre. As of January 2021 Odesa's population was approximately 1,015,826. In 1794, the modern city of Odesa was founded by a decree of the Russian empress Catherine the Great. From 1819 to 1858, Odesa was a free port. During the Soviet period, it was an important trading port and a naval base. During the 19th century, Odesa was the fourth largest city of the Russian Empire, after Moscow, Saint Petersburg and Warsaw. Its historical architecture is more Mediterranean than Russian, having been heavily influenced by French and Italian styles. Some buildings are built in a mixture of different styles, including Art Nouveau, Renaissance and Classicist.",
        "more": "Odesa is a warm-water port. The city of Odesa hosts both the Port of Odesa and Port Pivdennyi, a significant oil terminal situated in the city's suburbs. Another notable port, Chornomorsk, is located in the same oblast, to the south-west of Odesa. Together they represent a major transport hub integrating with railways. Odesa's oil and chemical processing facilities are connected to the Russian and other European networks by strategic pipelines. In 2000, the Quarantine Pier at Odesa Commercial Sea Port was declared a free port and free economic zone for a period of 25 years.",
        "latitude": 46.4825,
        "longitude": 30.7233,
        "heroPicture": "Odessa",
        "pictures": ["photo1", "photo2", "photo3", "photo4", "photo5", "photo6", "photo7", "photo8"],
        "advisory": "We accept no liability for any visitors eaten alive by bears."
    },
    {
        "id": 3,
        "name": "Kharkiv",
        "country": "NorthEast of Ukraine",
        "description": "Kharkiv (Ukrainian: Ха́рків, IPA: [ˈxɑrkiu̯]), also known as Kharkov (Russian: Харькoв, IPA: [ˈxarʲkəf]), is the second-largest city and municipality in Ukraine. Located in the northeast of the country, it is the largest city of the historic Slobozhanshchyna region. Kharkiv is the administrative centre of Kharkiv Oblast and of the surrounding Kharkiv Raion. The latest population is 1,433,886 (2021 est.). Kharkiv was founded in 1654 as Kharkiv fortress, and after these humble beginnings, it grew to be a major centre of industry, trade and Ukrainian culture in the Russian Empire. At the beginning of the 20th century, the city was predominantly Russian in population, but as industrial expansion drew in further labor from the distressed countryside, and as the Soviet regime moderated previous restrictions on Ukrainian cultural expression, by the eve of World War II the greater part of the population was officially identified as Ukrainian. From December 1919 to January 1934, Kharkiv was the first capital of the Ukrainian Soviet Socialist Republic.",
        "more": "In March and April 2014, security forces and counter-demonstrators defeated efforts by Russian-backed separatists to seize control of the city and regional administration. Kharkiv was a major target of the Northeastern Ukraine offensive in Russia's invasion of Ukraine that began in February 2022. In May, Russian forces were pressed back toward the international border, but the city remains under intermittent Russian fire.",
        "latitude": 49.9935,
        "longitude": 36.2304,
        "heroPicture": "Kharkiv",
        "pictures": ["photo3", "photo4", "photo5", "photo6", "photo7"],
        "advisory": ""
    },
    {
        "id": 4,
        "name": "Lviv",
        "country": "West of Ukraine",
        "description": "Lviv (Ukrainian: Львів, Polish: Lwów, Russian: Львов, German: Lemberg, Yiddish: לעמבערג) is the largest city in western Ukraine, and the sixth-largest in Ukraine, with a population of 717,273 (2022 est.). It serves as the administrative centre of Lviv Oblast and Lviv Raion,[4] and is one of the main cultural centres of Ukraine. It was named in honour of Leo, the eldest son of Daniel, King of Ruthenia. Lviv emerged as the centre of the historical regions of Red Ruthenia and Galicia in the 14th century, superseding Halych, Chełm, Belz and Przemyśl. It was the capital of the Kingdom of Galicia–Volhynia[5] from 1272 to 1349, when it was conquered by King Casimir III the Great of Poland. From 1434, it was the regional capital of the Ruthenian Voivodeship in the Kingdom of Poland. In 1772, after the First Partition of Poland, the city became the capital of the Habsburg Kingdom of Galicia and Lodomeria. In 1918, for a short time, it was the capital of the West Ukrainian People's Republic. Between the wars, the city was the centre of the Lwów Voivodeship in the Second Polish Republic. After the German-Soviet invasion of Poland in 1939, Lviv became part of the Soviet Union.",
        "more": "The once large Jewish community was sharply reduced in number by the Nazis during the Holocaust. For decades there was no working synagogue in the city after the final one was closed by the Soviets. The once predominant Polish population was for the greatest part sent to Poland in the context of a population exchange between Poland and Soviet Ukraine in 1944–46.",
        "latitude": 49.8397,
        "longitude": 24.0297,
        "heroPicture": "Lviv",
        "pictures": ["photo4", "photo5", "photo6", "photo7", "photo8"],
        "advisory": ""
    },
    {
        "id": 5,
        "name": "Poltava",
        "country": "Central Ukraine",
        "description": "Poltava (UK: /pɒlˈtɑːvə/, US: /pəlˈ-/; Ukrainian: Полтава [polˈtɑwɐ]) is a city located on the Vorskla River in central Ukraine. It is the capital city of the Poltava Oblast (province) and of the surrounding Poltava Raion (district) of the oblast. Poltava is administratively incorporated as a city of oblast significance and does not belong to the raion. It has a population of 283,402 (2021 est.) It is still unknown when Poltava was founded, although the town was not attested before 1174. However, for reasons unknown,[citation needed] municipal authorities chose to celebrate the city's 1100th anniversary in 1999. The settlement is indeed an old one, as archeologists unearthed a Paleolithic dwelling as well as Scythian remains within the city limits.",
        "more": "The most popular sport is football (soccer). Two professional football teams are based in the city: Vorskla Poltava in the Ukrainian Premier League and FC Poltava in the Second League. There are 3 stadiums in Poltava: Butovsky Vorskla Stadium (main city stadium), Dynamo Stadium are situated in the city centre and Lokomotiv Stadium which is situated in Podil district.",
        "latitude": 49.5883,
        "longitude": 34.5514,
        "heroPicture": "Poltava",
        "pictures": ["photo5", "photo6", "photo7", "photo8", "photo1", "photo2", "photo3", "photo4"],
        "advisory": ""
    },
    {
        "id": 6,
        "name": "Zaporizhzhia",
        "country": "SouthEast of Ukraine",
        "description": "Zaporizhzhia (Ukrainian: Запоріжжя) or Zaporozhye (Russian: Запорожье), until 1921 known as Aleksandrovsk or Oleksandrivsk, is a city in southeast Ukraine, situated on the banks of the Dnieper River. It is the administrative centre of Zaporizhzhia Oblast. Zaporizhzhia has a population of 710,052 (2022 est.) Zaporizhzhia is known for the historic island of Khortytsia, multiple power stations and for being an important industrial centre. Steel, aluminium, aircraft engines, automobiles, transformers for substations, and other heavy industrial goods are produced in the region.",
        "more": "Zaporizhzhia was founded in 1770, when the Aleksandrovskaya (Александровская) Fortress was built as a part of the Dnieper Defence Line, to protect the southern territories of the Russian Empire from Crimean Tatar invasions. Following the Treaty of Küçük Kaynarca in 1775, the southern lands of the Russian Plain and the Crimean peninsula were absorbed into the Russian Empire. The Aleksandrovskaya Fortress then lost its military significance, and became a small rural town, which from 1806 to around 1930 was called Alexandrovsk.",
        "latitude": 47.8388,
        "longitude": 35.1396,
        "heroPicture": "Zaporizhzhia",
        "pictures": ["photo6", "photo7", "photo8", "photo1", "photo2", "photo3", "photo4"],
        "advisory": ""
    },
    {
        "id": 7,
        "name": "Mariupol",
        "country": "Northern Coast of the Sea of Azov",
        "description": "Mariupol (UK: /ˌmæriˈuːpɒl/, US: /ˌmɑːriˈuːpəl/; Ukrainian: Маріу́поль [mɐr⁽ʲ⁾iˈupolʲ] (listen); Russian: Мариу́поль, IPA: [mərʲɪˈupəlʲ]) is a city in Donetsk Oblast, Ukraine. It is situated on the northern coast (Pryazovia) of the Sea of Azov, at the mouth of the Kalmius River. Prior to the 2022 Russian invasion of Ukraine, it was the tenth-largest city in the country and the second-largest city in Donetsk Oblast, with an estimated population of 425,681 people in January 2022.[2] However, Mariupol has been militarily controlled by Russia since May 2022, and the city's residents are now estimated to number around 100,000, according to Ukrainian authorities. Historically, the city of Mariupol was a centre for trade and manufacturing, and played a key role in the development of higher education and many businesses while also serving as a coastal resort on the Black Sea. From 1948 to 1989, the city was known as Zhdanov, named after Andrei Zhdanov, a high-ranking official of the Communist Party of the Soviet Union; the name was part of a larger effort to rename cities after high-ranking political figures in the Soviet Union.[4] Mariupol was founded on the site of a former encampment for Cossacks, known as Kalmius,[5] and was granted city rights within the Russian Empire in 1778. It played a key role in the Soviet-era industrialization of Ukraine; it was a centre for grain trade, metallurgy, and heavy engineering—including the Illich Iron and Steel Works and the Azovstal Iron and Steel Works.",
        "more": "Beginning on 24 February 2022, the three-month-long Russian siege of Mariupol largely destroyed the city, for which it was given the title <Hero City of Ukraine> by the Ukrainian government.[6] On 16 May 2022, all Ukrainian troops who remained in Mariupol surrendered at Azovstal Iron and Steel Works, as the Russian military secured complete control over the city by 20 May 2022.",
        "latitude": 47.0971,
        "longitude": 37.5434,
        "heroPicture": "Mariupol",
        "pictures": ["photo7", "photo8", "photo1", "photo2", "photo3", "photo4", "photo5", "photo6"],
        "advisory": ""
    },
    {
        "id": 8,
        "name": "Ivano-Frankivsk",
        "country": "Western Ukraine",
        "description": "Ivano-Frankivsk (Ukrainian: Іва́но-Франкі́вськ, romanized: Iváno-Frankívśk [iˈwɑno frɐnˈkiu̯sʲk], Russian: Ивано-Франковск, romanized: Ivano-Frankovsk), formerly Stanyslaviv[2] (Polish: Stanisławów [staɲisˈwavuf]; German: Stanislau, Russian: Станиславов), is a city located in Western Ukraine. It is the administrative centre of Ivano-Frankivsk Oblast and Ivano-Frankivsk Raion. Ivano-Frankivsk hosts the administration of Ivano-Frankivsk urban hromada.[4] Its population is 238,196 (2022 est.). Built in the mid-17th century as a fortress of the Polish Potocki family, Stanisławów was annexed to the Habsburg Empire during the First Partition of Poland in 1772, after which it became the property of the State within the Austrian Empire. The fortress was slowly transformed into one of the most prominent cities at the foothills of the Carpathian Mountains. After World War I, for several months, it served as a temporary capital of the West Ukrainian People's Republic. Following the Peace of Riga in 1921, Stanisławów became part of the Second Polish Republic. After the Soviet invasion of Poland at the onset of World War II, the city was annexed by the Soviet Union, only to be occupied by Nazi Germany two years later. With the liberation of Soviet Ukraine in 1944 and the shifting of borders, the Communist regime ran the city for the next four-and-a-half decades. A few years before the fall of the Soviet Union, the blue-yellow flag was raised in the city as the symbol of an independent Ukraine.",
        "more": "A city visitor may find elements of various cultures intertwined within Ivano-Frankivsk, the Polish city hall, the Austro-Hungarian city's business centre, the Soviet prefabricated apartment blocks at the city's rural–urban fringe, and others. Ivano-Frankivsk is also one of the principal cities of the Carpathian Euroregion.",
        "latitude": 48.9226,
        "longitude": 24.7111,
        "heroPicture": "Ivano-Frankivsk",
        "pictures": ["photo8", "photo1", "photo2", "photo3", "photo4"],
        "advisory": ""
    },
    {
        "id": 9,
        "name": "Donetsk",
        "country": "Eastern Ukraine",
        "description": "Donetsk (UK: /dɒˈnjɛtsk/ don-YETSK, US: /dəˈn(j)ɛtsk/ də-N(Y)ETSK;[2][3] Ukrainian: Донецьк, romanized: Donets'k [doˈnɛtsʲk]; Russian: Донецк [dɐˈnʲetsk] (listen)), formerly known as Aleksandrovka, Yuzivka (or Hughesovka), Stalin and Stalino (see also: cities' alternative names), is an industrial city in eastern Ukraine located on the Kalmius River in Donetsk Oblast. The population was estimated at 901,645 (2022 est.)[4] in the city core, with over 2 million in the metropolitan area (2011). According to the 2001 census, Donetsk was the fifth-largest city in Ukraine. Administratively, Donetsk has been the centre of Donetsk Oblast, while historically, it is the unofficial capital and largest city of the larger economic and cultural Donets Basin (Donbas) region. Donetsk is adjacent to another major city, Makiivka, and along with other surrounding cities forms a major urban sprawl and conurbation in the region. Donetsk has been a major economic, industrial and scientific centre of Ukraine with a high concentration of heavy industries and a skilled workforce. The density of heavy industries (predominantly steel production, chemical industry, and coal mining) determined the city's challenging ecological situation. In 2012, a UN report ranked Donetsk among the world's fastest depopulating cities.",
        "more": "Since April 2014, Donetsk and its surrounding areas have been one of the major sites of fighting in the ongoing Russo-Ukrainian War, as pro-Russian separatist forces battle against Ukrainian military forces for control of the city and surrounding areas. Throughout the war, the city of Donetsk has been administered by the pro-Russian separatist forces as the center of the Donetsk People's Republic (DPR), with outlying territories of the Donetsk region divided between the two sides.[7] Donetsk International Airport became the epicenter of the war in 2014 with almost a year-long battle.",
        "latitude": 48.0159,
        "longitude": 37.8028,
        "heroPicture": "Donetsk",
        "pictures": ["photo1", "photo2", "photo3", "photo4", "photo5", "photo6", "photo7", "photo8"],
        "advisory": "We accept no liability for any visitors eaten alive by drop bears."
    },
    {
        "id": 10,
        "name": "Luhansk",
        "country": "East of Ukraine",
        "description": "Luhansk (UK: /luːˈhænsk/, US: /-ˈhɑːnsk/; Ukrainian: Луганськ, pronounced [lʊˈɦɑnʲsʲk]), also known as Lugansk (UK: /-ˈɡænsk/, US: /-ˈɡɑːnsk/; Russian: Луганск, pronounced [lʊˈɡansk]), is a city in what is internationally recognised as Ukraine, although it is administered by Russia as capital of the Luhansk People's Republic (LPR). As of 2022, the population was estimated to be 397,677 (2022 est.), making Luhansk the most populous city in the region and the 12th largest in Ukraine. In 2001, nearly half of the population was ethnically Ukrainian, and 47% was ethnically Russian. Luhansk has been the capital and administrative center of Luhansk Oblast, although the Ukrainian administration was relocated to Sievierodonetsk when the War in Donbas broke out following the establishment of LPR.",
        "more": "Luhansk was named after the Luhan River, which flows through the city. According to folk etymology, the name is also derived to the word <Luh> (Ukrainian: Луг), which means <meadow>, referring to the floodplains around the river.",
        "latitude": 48.5740,
        "longitude": 39.3078,
        "heroPicture": "Luhansk",
        "pictures": ["photo2", "photo3", "photo4", "photo5", "photo6", "photo7", "photo8", "photo1"],
        "advisory": "We accept no liability for any visitors eaten alive by Pokemon."
    },
]
